app/controllers/baseballs_controller.rb

  def index
    @baseballs = Baseball.all
---
SELECT "baseballs".* FROM "baseballs"

  def create
    @baseball = Baseball.new(baseball_params)

    respond_to do |format|
      if @baseball.save
---
INSERT INTO "baseballs" ("name", "age", "position", "batting_average", "is_free_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "JC"], ["age", 24], ["position", "CF"], ["batting_average", 0.266], ["is_free_agent", "t"], ["created_at", "2015-03-23 15:24:21.633195"], ["updated_at", "2015-03-23 15:24:21.633195"]]

  def update
    respond_to do |format|
      if @baseball.update(baseball_params)
---
UPDATE "baseballs" SET "name" = ?, "batting_average" = ?, "updated_at" = ? WHERE "baseballs"."id" = ?  [["name", "Rick"], ["batting_average", 234.0], ["updated_at", "2015-03-23 15:57:32.698611"], ["id", 3]]

  def destroy
    @baseball.destroy
---
DELETE FROM "baseballs" WHERE "baseballs"."id" = ?  [["id", 1]]

    def set_baseball
      @baseball = Baseball.find(params[:id])
---
SELECT  "baseballs".* FROM "baseballs" WHERE "baseballs"."id" = ? LIMIT 1  [["id", 1]]